{
  "architectures": [
    "BertForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "dtype": "float32",
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "O",
    "1": "B-HOSPITAL",
    "2": "I-HOSPITAL",
    "3": "B-PATIENT_NAME",
    "4": "I-PATIENT_NAME",
    "5": "B-CLAIM_ID",
    "6": "I-CLAIM_ID",
    "7": "B-POLICY_NUMBER",
    "8": "I-POLICY_NUMBER",
    "9": "B-ADMISSION_DATE",
    "10": "I-ADMISSION_DATE",
    "11": "B-DISCHARGE_DATE",
    "12": "I-DISCHARGE_DATE",
    "13": "B-DIAGNOSIS",
    "14": "I-DIAGNOSIS",
    "15": "B-PROCEDURE",
    "16": "I-PROCEDURE",
    "17": "B-ICD_CODE",
    "18": "I-ICD_CODE",
    "19": "B-AMOUNT",
    "20": "I-AMOUNT",
    "21": "B-SERVICE_DATE",
    "22": "I-SERVICE_DATE",
    "23": "B-FACILITY_ADDRESS",
    "24": "I-FACILITY_ADDRESS",
    "25": "B-DOCTOR_NAME",
    "26": "I-DOCTOR_NAME"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "B-ADMISSION_DATE": 9,
    "B-AMOUNT": 19,
    "B-CLAIM_ID": 5,
    "B-DIAGNOSIS": 13,
    "B-DISCHARGE_DATE": 11,
    "B-DOCTOR_NAME": 25,
    "B-FACILITY_ADDRESS": 23,
    "B-HOSPITAL": 1,
    "B-ICD_CODE": 17,
    "B-PATIENT_NAME": 3,
    "B-POLICY_NUMBER": 7,
    "B-PROCEDURE": 15,
    "B-SERVICE_DATE": 21,
    "I-ADMISSION_DATE": 10,
    "I-AMOUNT": 20,
    "I-CLAIM_ID": 6,
    "I-DIAGNOSIS": 14,
    "I-DISCHARGE_DATE": 12,
    "I-DOCTOR_NAME": 26,
    "I-FACILITY_ADDRESS": 24,
    "I-HOSPITAL": 2,
    "I-ICD_CODE": 18,
    "I-PATIENT_NAME": 4,
    "I-POLICY_NUMBER": 8,
    "I-PROCEDURE": 16,
    "I-SERVICE_DATE": 22,
    "O": 0
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "transformers_version": "4.57.3",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
